# Помните в конце первой лекции Вы прошли срезы строк?
# Также существует срез списка,
# давайте научимся изменять наш список

#!!!!! Список определяется квадратными []- скобками!!!!!!!


list_4 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list_4[0]) # 1
print(list_4[1]) # 2
print(list_4[len(list_4)-1]) # 10
print(list_4[-5]) # 6
print(list_4[:]) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list_4[:2]) # [1, 2]
print(list_4[len(list_4)-2:]) #[9, 10]
print(list_4[2:9]) # [3, 4, 5, 6, 7, 8, 9]
print(list_4[6:-18]) # []
print(list_4[0:len(list_4):6]) # [1, 7]
print(list_4[::6]) # [1, 7]